# Getting Financial Data - Pandas Datareader

### Introduction:

This time you will get data from a website.


### Step 1. Import the necessary libraries

In [18]:
import numpy as np
import pandas as pd
import pandas_datareader.data as web

from datetime import datetime

### Step 2. Create your time range (start and end variables). The start date should be 01/01/2015 and the end should today (whatever your today is).

In [19]:
start_date = datetime(2015,1,1)
end_date = datetime(2024, 6, 1)
symbol = "AAPL"
api_key = "0VSUZME3SECYTSKJ"

### Step 3. Get an API key for one of the APIs that are supported by Pandas Datareader, preferably for AlphaVantage.

If you do not have an API key for any of the supported APIs, it is easiest to get one for [AlphaVantage](https://www.alphavantage.co/support/#api-key). (Note that the API key is shown directly after the signup. You do *not* receive it via e-mail.)

(For a full list of the APIs that are supported by Pandas Datareader, [see here](https://pydata.github.io/pandas-datareader/readers/index.html). As the APIs are provided by third parties, this list may change.)

### Step 4. Use Pandas Datarader to read the daily time series for the Apple stock (ticker symbol AAPL) between 01/01/2015 and today, assign it to df_apple and print it.

In [24]:
apple = web.get_data_alphavantage('AAPL', api_key=api_key, start=start_date, end=end_date)

### Step 5. Add a new column "stock" to the dataframe and add the ticker symbol

In [25]:
apple['stock'] = 'AAPL'
apple

              open     high       low   close    volume stock
2015-01-02  111.39  111.440  107.3500  109.33  53204626  AAPL
2015-01-05  108.29  108.650  105.4100  106.25  64285491  AAPL
2015-01-06  106.54  107.430  104.6300  106.26  65797116  AAPL
2015-01-07  107.20  108.200  106.6950  107.75  40105934  AAPL
2015-01-08  109.23  112.150  108.7000  111.89  59364547  AAPL
...            ...      ...       ...     ...       ...   ...
2024-05-24  188.82  190.580  188.0404  189.98  36326975  AAPL
2024-05-28  191.51  193.000  189.1000  189.99  52280051  AAPL
2024-05-29  189.61  192.247  189.5100  190.29  53068016  AAPL
2024-05-30  190.76  192.180  190.6300  191.29  49947941  AAPL
2024-05-31  191.44  192.570  189.9100  192.25  75158277  AAPL

[2369 rows x 6 columns]

### Step 6. Repeat the two previous steps for a few other stocks, always creating a new dataframe: Tesla, IBM and Microsoft. (Ticker symbols TSLA, IBM and MSFT.)

In [29]:
msft = web.get_data_alphavantage('MSFT', api_key=api_key, start=start_date, end=end_date)
msft['stock'] = 'MSFT'
msft

              open      high     low    close    volume stock
2015-01-02   46.66   47.4200   46.54   46.760  27913852  MSFT
2015-01-05   46.37   46.7300   46.25   46.325  39673865  MSFT
2015-01-06   46.38   46.7490   45.54   45.650  36447854  MSFT
2015-01-07   45.98   46.4600   45.49   46.230  29114061  MSFT
2015-01-08   46.75   47.7499   46.72   47.590  29645202  MSFT
...            ...       ...     ...      ...       ...   ...
2024-05-24  427.19  431.0550  424.41  430.160  11855285  MSFT
2024-05-28  429.63  430.8200  426.60  430.320  15718024  MSFT
2024-05-29  425.69  430.9400  425.69  429.170  15517130  MSFT
2024-05-30  424.30  424.3000  414.24  414.670  28424847  MSFT
2024-05-31  416.75  416.7500  404.51  415.130  47995250  MSFT

[2369 rows x 6 columns]

In [30]:
tsla = web.get_data_alphavantage('TSLA', api_key=api_key, start=start_date, end=end_date)
tsla['stock'] = 'TSLA'
tsla

               open      high       low    close    volume stock
2015-01-02  222.870  223.2500  213.2600  219.310   4764443  TSLA
2015-01-05  214.550  216.5000  207.1626  210.090   5368477  TSLA
2015-01-06  210.060  214.2000  204.2100  211.280   6261936  TSLA
2015-01-07  213.350  214.7800  209.7800  210.950   2968390  TSLA
2015-01-08  212.810  213.7999  210.0100  210.615   3442509  TSLA
...             ...       ...       ...      ...       ...   ...
2024-05-24  174.835  180.0800  173.7300  179.240  65584478  TSLA
2024-05-28  176.400  178.2500  173.1600  176.750  59736620  TSLA
2024-05-29  174.190  178.1500  173.9300  176.190  54782649  TSLA
2024-05-30  178.575  182.6700  175.3800  178.790  77784755  TSLA
2024-05-31  178.500  180.3200  173.8200  178.080  67314602  TSLA

[2369 rows x 6 columns]

In [31]:
ibm = web.get_data_alphavantage('IBM', api_key=api_key, start=start_date, end=end_date)
ibm['stock'] = 'IBM'

### Step 7. Combine the four separate dataFrames into one combined dataFrame df that holds the information for all four stocks

In [35]:
df = pd.concat([apple, msft, ibm,tsla])
df.sort_index()

              open    high     low    close    volume stock
2015-01-02  111.39  111.44  107.35  109.330  53204626  AAPL
2015-01-02   46.66   47.42   46.54   46.760  27913852  MSFT
2015-01-02  161.31  163.31  161.00  162.060   5525341   IBM
2015-01-02  222.87  223.25  213.26  219.310   4764443  TSLA
2015-01-05   46.37   46.73   46.25   46.325  39673865  MSFT
...            ...     ...     ...      ...       ...   ...
2024-05-30  190.76  192.18  190.63  191.290  49947941  AAPL
2024-05-31  416.75  416.75  404.51  415.130  47995250  MSFT
2024-05-31  191.44  192.57  189.91  192.250  75158277  AAPL
2024-05-31  165.70  166.97  163.84  166.850   4905002   IBM
2024-05-31  178.50  180.32  173.82  178.080  67314602  TSLA

[9476 rows x 6 columns]

### Step 8. Shift the stock column into the index (making it a multi-level index consisting of the ticker symbol and the date).

In [36]:
# Giáº£ sá»­ df lÃ  DataFrame cá»§a báº¡n
df.set_index(['stock', df.index], inplace=True)
df

                     open    high      low   close    volume
stock
AAPL  2015-01-02  111.390  111.44  107.350  109.33  53204626
      2015-01-05  108.290  108.65  105.410  106.25  64285491
      2015-01-06  106.540  107.43  104.630  106.26  65797116
      2015-01-07  107.200  108.20  106.695  107.75  40105934
      2015-01-08  109.230  112.15  108.700  111.89  59364547
...                   ...     ...      ...     ...       ...
TSLA  2024-05-24  174.835  180.08  173.730  179.24  65584478
      2024-05-28  176.400  178.25  173.160  176.75  59736620
      2024-05-29  174.190  178.15  173.930  176.19  54782649
      2024-05-30  178.575  182.67  175.380  178.79  77784755
      2024-05-31  178.500  180.32  173.820  178.08  67314602

[9476 rows x 5 columns]

### Step 7. Create a dataFrame called vol, with the volume values.

In [38]:
vol = df[['volume']].copy()
vol

                    volume
stock
AAPL  2015-01-02  53204626
      2015-01-05  64285491
      2015-01-06  65797116
      2015-01-07  40105934
      2015-01-08  59364547
...                    ...
TSLA  2024-05-24  65584478
      2024-05-28  59736620
      2024-05-29  54782649
      2024-05-30  77784755
      2024-05-31  67314602

[9476 rows x 1 columns]

### Step 8. Aggregate the data of volume to weekly.
Hint: Be careful to not sum data from the same week of 2015 and other years.

In [41]:
vol.groupby("stock").volume.sum()

stock
AAPL    129553687724
IBM      11089218348
MSFT     69530274153
TSLA     80140339563
Name: volume, dtype: int64

### Step 9. Find all the volume traded in the year of 2015

In [43]:
vol.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9476 entries, 2015-01-02 to 2024-05-31
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   9476 non-null   object
 1   volume  9476 non-null   int64
dtypes: int64(1), object(1)
memory usage: 222.1+ KB

In [49]:
df_2015 = df[df.index.get_level_values(1).str.startswith('2015')]
df_2015.groupby("stock").volume.sum()

stock
AAPL    13064316775
IBM      1105545521
MSFT     9057582311
TSLA     1086708380
Name: volume, dtype: int64